DataProcessors/МенеджерПрямогоОбмена_Весовая.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<Name>МенеджерПрямогоОбмена_Весовая</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/УзлыПрямогоОбменаДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>УзлыПрямогоОбменаДанными</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяСтрокиПодключенияУзла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьХешИдентификатораУзла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтотУзел</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийОбработчикДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоположениеWSDL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>URIПространстваИменСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяТочкиПодключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоМенеджераОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеСобытия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УзелОбмена</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УзлыПрямогоОбменаДанными</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяМетода</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяВызываемогоСобытия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/МенеджерПрямогоОбмена_Весовая/Ext/ObjectModule.bsl
Функция Версия() Экспорт
	
	Возврат "ВС.1.240821";
	
КонецФункции

Функция ИнициализацияСоединения(ДанныеУзлаПодключения) Экспорт
	
	Определение = Новый WSОпределения(ДанныеУзлаПодключения.МестоположениеWSDL, ДанныеУзлаПодключения.Пользователь, ДанныеУзлаПодключения.Пароль);
    Прокси = Новый WSПрокси(Определение, ДанныеУзлаПодключения.URIПространстваИменСервиса, ДанныеУзлаПодключения.ИмяСервиса, ДанныеУзлаПодключения.ИмяТочкиПодключения);       
		
	Прокси.Пользователь = ДанныеУзлаПодключения.Пользователь;
    Прокси.Пароль = ДанныеУзлаПодключения.Пароль;
	
	Возврат Прокси;
	
КонецФункции

#Область Обмен_УТ

#Область Отправка_СтатусСостоянияУзла

Функция ПодготовитьДанныеДляОтправки_СтатусСостоянияУзла(ДанныеУзлаПодключения) Экспорт 
	
	ЗначениеВозврата = новый Структура;
	
	ЗначениеВозврата.Вставить("ИмяУзла", ДанныеУзлаПодключения.Наименование);
	ЗначениеВозврата.Вставить("Код", ДанныеУзлаПодключения.Код);
	ЗначениеВозврата.Вставить("ДатаСтатуса", ТекущаяДата());
	
	Возврат ЗначениеВозврата;
	
КонецФункции

Функция ВыполнитьОтправку_СтатусСостоянияУзла(НаименованиеУзла) Экспорт
	
	ТекущийУзел = Справочники.УзлыПрямогоОбменаДанными.НайтиПоРеквизиту("ЭтотУзел", Истина);
	
	ДанныеУзлаПодключения = Обработки.УправлениеНастройкамиПрямогоОбмена.ПолучитьДанныеУзлаОбменаПоНаименованию(НаименованиеУзла);
	
	Прокси =  ИнициализацияСоединения(ДанныеУзлаПодключения);
	
	ДанныеДляОтправки = ПодготовитьДанныеДляОтправки_СтатусСостоянияУзла(ТекущийУзел);
	Хранилище = Новый ХранилищеЗначения(ДанныеДляОтправки);
	
	СтрокаПодключения = СтрокаСоединенияИнформационнойБазы();
	хешИд = Обработки.УправлениеНастройкамиПрямогоОбмена.СформироватьХешИдентификаторУзла(СтрокаПодключения);
	  
	Результат = Прокси.MessageEx(хешИд, Хранилище, "Весовая_СтатусОбъекта");
	Результат = СериализаторXDTO.ПрочитатьXDTO(Результат);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Отправка_ОбменаДанными

Функция ВыполнитьОтправку_ОбменДанными(НаименованиеУзла) Экспорт
	
	ТекущийУзел = Справочники.УзлыПрямогоОбменаДанными.НайтиПоРеквизиту("ЭтотУзел", Истина);
	
	ДанныеУзлаПодключения = Обработки.УправлениеНастройкамиПрямогоОбмена.ПолучитьДанныеУзлаОбменаПоНаименованию(НаименованиеУзла);
	
	Прокси =  ИнициализацияСоединения(ДанныеУзлаПодключения);
	
	ДанныеДляОтправки = ПодготовитьДанныеДляОтправки_ДанныеДляОбмена(ТекущийУзел);
	Хранилище = Новый ХранилищеЗначения(ДанныеДляОтправки);
	
	СтрокаПодключения = СтрокаСоединенияИнформационнойБазы();
	хешИд = Обработки.УправлениеНастройкамиПрямогоОбмена.СформироватьХешИдентификаторУзла(СтрокаПодключения);
	  
	Результат = Прокси.MessageEx(хешИд, Хранилище, "Весовая_ОбменДанными");
	Результат = СериализаторXDTO.ПрочитатьXDTO(Результат);
	
	ВыполнитьОбработкуРезультата_ДанныеДляОбмена(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ВыполнитьОбработкуРезультата_ДанныеДляОбмена(Результат) Экспорт 
	
	Если Результат.Отказ = Ложь Тогда
		
		Данные = Результат.Результат;
		
		Данные = Обработки.УправлениеНастройкамиПрямогоОбмена.ПодготовитьДанныеДляОбработки(Данные, "ЧтениеXML");
		
		ЦПЗ_Обмены.ЗагрузитьДанныеВБазуЧтениеXML(Данные);
		
	КонецЕсли;	
	
	Возврат Истина;
	
КонецФункции

Функция ПодготовитьДанныеДляОтправки_ДанныеДляОбмена(Отправитель_ИмяУзла) Экспорт 
	
	Стр = ЦПЗ_Обмены.ВыполнитьВыгрузкуВПоток();
	Возврат Стр;
	
КонецФункции

#КонецОбласти

#КонецОбласти
